Revit 2026 API

# MacroModuleIterator Properties

---

The MacroModuleIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

MacroModuleIterator Class

Autodesk.Revit.DB.Macros Namespace